Repository: tano-systems/luci-app-shellinabox
Catalog: po/*/shellinabox.po
Languages: ru

source: Basic Settings
ru: Основные настройки

source: Can't load non-SSL terminal into page loaded over HTTPS
ru: Невозможно загрузить не SSL терминал на страницу, загруженную по протоколу HTTPS

source: Enable SSL
ru: Включить SSL

source: Failed to regenerate SSL certificate:
ru: Не удалось перегенерировать SSL-сертификат:

source: File file must contain private key and certificate parts.
ru: Файл должен включать в себя части с закрытым ключом и сертификатом.

source: Grant access to web terminal
ru: Предоставить доступ к веб-терминалу

source: Grant access to web terminal configuration
ru: Предоставить доступ к конфигурации веб-терминала

source: HTTPS certificate (PEM&nbsp;format)
ru: Сертификат HTTPS (формат&nbsp;PEM)

source: If terminal is not displayed and you are using self-signed SSL certificate may you need to open terminal in a separate browser window using the appropriate button above and approve the certificate manually. After approving the certificate you need to reload this page or use terminal in opened window.
ru: Если терминал не отображается и используется самоподписанный SSL-сертификат, может потребоваться открыть терминал в отдельном окне браузера с помощью соответствующей кнопки выше и подтвердить сертификат вручную. После подтверждения сертификата необходимо перезагрузить данную страницу или использовать терминал в открывшемся окне.

source: Open terminal in a separate window
ru: Открыть терминал в отдельном окне

source: Port
ru: Порт

source: Port to listen (default: 4200)
ru: Порт для входящих соединений (по умолчанию: 4200)

source: Regenerate SSL certificate
ru: Перегенерировать SSL-сертификат

source: SSL Settings
ru: Настройки SSL

source: Settings
ru: Настройки

source: Suppress all audio output
ru: Отключить вывод звуковых сигналов

source: Terminal
ru: Терминал

source: Terminal server will delete current certificate file and generate a new self-signed certificate
ru: Служба терминала удалит существуюий сертификат и автоматически сгенерирует новый самоподписанный сертификат

source: Web Terminal
ru: Веб-терминал

source: Web Terminal Settings
ru: Настройки веб-терминала

source: You can enable SSL in <a href="%s">terminal settings</a> page or use HTTP connection instead of HTTPS. Also you can open terminal in a separate window using the appropriate button below.
ru: Вы можете включить поддержку SSL на странице <a href="%s">настроек терминала</a> или использовать HTTP подключение вместо HTTPS. Также вы можете открыть терминал в отдельном окне браузера, используя для этого соответствующую кнопку ниже.
